In [1]:
# http://www.ad.co.kr

In [ ]:
# 2015ad.csv ~ 2019ad.csv

In [ ]:
# 광고비 지출 상위기업의 광고비용 변화율 분석...
# 연도별 광고비 지출 추이 분석.. 기업의 사업성과를 예측...

In [2]:
import pandas as  pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
pwd

'D:\\bd\\eda'

In [6]:
import os 
os.listdir('./eda_data_files')

['01. CCTV_in_Seoul.csv',
 '01. CCTV_result.csv',
 '01. population_in_Seoul.xls',
 '2015ad.csv',
 '2016ad.csv',
 '2017ad.csv',
 '2018ad.csv',
 '2019ad.csv',
 '911.csv',
 'Ecommerce Purchases',
 'movies.xlsx',
 'naver_ad.csv',
 'phone_data.csv',
 'Salaries1.csv',
 'seoul_weather.csv',
 'titanic_data.csv',
 'wages.csv',
 '상가업소정보_201912_01.csv',
 '전국 평균 분양가격(2013년 9월부터 2015년 8월까지).csv',
 '전국도시공원표준데이터.csv',
 '주택도시보증공사_전국 평균 분양가격(2019년 12월).csv']

In [9]:
df2015 = pd.read_csv('./eda_data_files/2015ad.csv', index_col=0)

In [14]:
df2015.head()

   firm        tv   radio newpaper magazine
0   회사명        TV     라디오       신문       잡지
1  삼성전자  11479225  423815  6203885   242300
2    KT   8380633  368017   905887    25100
3  LG전자   6748621  342048  1969787   114800
4  한국지엠   6791838  596281   662799    35200

In [11]:
df2015.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   firm      100 non-null    object
 1   tv        100 non-null    object
 2   radio     100 non-null    object
 3   newpaper  100 non-null    object
 4   magazine  100 non-null    object
dtypes: object(5)
memory usage: 4.7+ KB

In [16]:
df2015.drop(0, inplace=True)
df2015.head()

    firm        tv   radio newpaper magazine
1   삼성전자  11479225  423815  6203885   242300
2     KT   8380633  368017   905887    25100
3   LG전자   6748621  342048  1969787   114800
4   한국지엠   6791838  596281   662799    35200
5  현대자동차   4453752  414230  2817550   108300

In [18]:
df2015.set_index('firm', inplace=True)

In [19]:
df2015.head()

             tv   radio newpaper magazine
firm
삼성전자   11479225  423815  6203885   242300
KT      8380633  368017   905887    25100
LG전자    6748621  342048  1969787   114800
한국지엠    6791838  596281   662799    35200
현대자동차   4453752  414230  2817550   108300

In [20]:
for c in df2015.columns:
    df2015[c] = pd.to_numeric(df2015[c])

In [21]:
df2015.info()

<class 'pandas.core.frame.DataFrame'>
Index: 99 entries, 삼성전자 to 대신증권
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   tv        99 non-null     int64
 1   radio     99 non-null     int64
 2   newpaper  99 non-null     int64
 3   magazine  99 non-null     int64
dtypes: int64(4)
memory usage: 3.9+ KB

In [22]:
df2015['time'] = '2015.09'
df2015.head()

             tv   radio  newpaper  magazine     time
firm
삼성전자   11479225  423815   6203885    242300  2015.09
KT      8380633  368017    905887     25100  2015.09
LG전자    6748621  342048   1969787    114800  2015.09
한국지엠    6791838  596281    662799     35200  2015.09
현대자동차   4453752  414230   2817550    108300  2015.09

In [ ]:
# 2015ad.csv ~ 2019ad.csv

In [27]:
files = [f for f in os.listdir('./eda_data_files') if 'ad.csv' in f][:-1]
files

['2015ad.csv', '2016ad.csv', '2017ad.csv', '2018ad.csv', '2019ad.csv']